In [1]:
import numpy as np
import pandas as pd

# 1. 딕셔너리를 이용한 생성
ipsa = {'순번': [2301, 2302, 2303, 2304, 2305],
        '이름': ['차은우', '송혜교', '지창욱', '박서준', '아이유'],
        '성적': [95, 96, 92, 87, 93]}
df = pd.DataFrame(ipsa)
print(df)

     순번   이름  성적
0  2301  차은우  95
1  2302  송혜교  96
2  2303  지창욱  92
3  2304  박서준  87
4  2305  아이유  93

In [2]:
# 응용
# 1. 순번은 학번으로, 성적은 국어로 열 이름을 변경해보세요. 단, 동시에 열 이름 적용을 진행
df.rename(columns={'이름': '성명', '순번': '학번', '성적': '국어'}, inplace=True)
df

     학번   성명  국어
0  2301  차은우  95
1  2302  송혜교  96
2  2303  지창욱  92
3  2304  박서준  87
4  2305  아이유  93

In [3]:
#2. 열 '국어' 뒤에 '영어' 점수를 추가
# 영어
# 80
# 70
# 60
# 90
# 95
df.insert(3, '영어', [80, 70, 60, 90, 95])
df

     학번   성명  국어  영어
0  2301  차은우  95  80
1  2302  송혜교  96  70
2  2303  지창욱  92  60
3  2304  박서준  87  90
4  2305  아이유  93  95

In [4]:
# 3. 열 '총점'에 모두 0 데이터를 삽입
df['총점'] = 0
df

     학번   성명  국어  영어  총점
0  2301  차은우  95  80   0
1  2302  송혜교  96  70   0
2  2303  지창욱  92  60   0
3  2304  박서준  87  90   0
4  2305  아이유  93  95   0

In [5]:
# 4. 열 '총점'에 국어, 영어 점수 합계를 계산하여 총점
# 총점=국어+영어
df['총점'] = df['국어'] + df['영어']
df

     학번   성명  국어  영어   총점
0  2301  차은우  95  80  175
1  2302  송혜교  96  70  166
2  2303  지창욱  92  60  152
3  2304  박서준  87  90  177
4  2305  아이유  93  95  188

In [9]:
# 5. 열 '평균'에 총점/2를 계산하여 데이터를 삽입. 평균은 소숫점 둘째자리까지 표시
df['평균'] = df['총점'] / 2
# 소숫점 둘째자리 표시 옵션
pd.options.display.float_format = '{:,.2f}'.format
df

     학번   성명  국어  영어   총점    평균
0  2301  차은우  95  80  175 87.50
1  2302  송혜교  96  70  166 83.00
2  2303  지창욱  92  60  152 76.00
3  2304  박서준  87  90  177 88.50
4  2305  아이유  93  95  188 94.00

In [10]:
# 6. 평균(avg)이 85점 이상인 사람 조회
df[df['평균'] >= 85]

     학번   성명  국어  영어   총점    평균
0  2301  차은우  95  80  175 87.50
3  2304  박서준  87  90  177 88.50
4  2305  아이유  93  95  188 94.00

In [11]:
# 7. 국어 점수와 영어 점수가 모두 90점 이상인 사람 조회
df[(df['국어'] >= 90) & (df['영어'] >= 90)]

     학번   성명  국어  영어   총점    평균
4  2305  아이유  93  95  188 94.00

In [12]:
# 8. 국어 점수가 90점 이상이거나 평균이 85점 이상인 사람 조회
df[(df['국어'] >= 90) | (df['평균'] >= 85)]

     학번   성명  국어  영어   총점    평균
0  2301  차은우  95  80  175 87.50
1  2302  송혜교  96  70  166 83.00
2  2303  지창욱  92  60  152 76.00
3  2304  박서준  87  90  177 88.50
4  2305  아이유  93  95  188 94.00